xsession/openocd/svd/microchip/dspic33fj128mc802.svd
        <register>
          <name>IPC3</name>
          <displayName>IPC3</displayName>
          <description>IPC3</description>
          <addressOffset>0xaa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x444</resetValue>
          <resetMask>0x777</resetMask>
          <fields>
            <field>
              <name>U1TXIP</name>
              <description>U1TXIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4</name>
          <displayName>IPC4</displayName>
          <description>IPC4</description>
          <addressOffset>0xac</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>SI2C1IP</name>
              <description>SI2C1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5</name>
          <displayName>IPC5</displayName>
          <description>IPC5</description>
          <addressOffset>0xae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4404</resetValue>
          <resetMask>0x7707</resetMask>
          <fields>
            <field>
              <name>INT1IP</name>
              <description>INT1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6</name>
          <displayName>IPC6</displayName>
          <description>IPC6</description>
          <addressOffset>0xb0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>DMA2IP</name>
              <description>DMA2IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7</name>
          <displayName>IPC7</displayName>
          <description>IPC7</description>
          <addressOffset>0xb2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>T5IP</name>
              <description>T5IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8</name>
          <displayName>IPC8</displayName>
          <description>IPC8</description>
          <addressOffset>0xb4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4444</resetValue>
          <resetMask>0x7777</resetMask>
          <fields>
            <field>
              <name>SPI2EIP</name>
              <description>SPI2EIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9</name>
          <displayName>IPC9</displayName>
          <description>IPC9</description>
          <addressOffset>0xb6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>DMA3IP</name>
              <description>DMA3IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11</name>
          <displayName>IPC11</displayName>
          <description>IPC11</description>
          <addressOffset>0xba</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x440</resetValue>
          <resetMask>0x770</resetMask>
          <fields>
            <field>
              <name>PMPIP</name>
              <description>PMPIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC14</name>
          <displayName>IPC14</displayName>
          <description>IPC14</description>
          <addressOffset>0xc0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x440</resetValue>
          <resetMask>0x770</resetMask>
          <fields>
            <field>
              <name>PWM1IP</name>
              <description>PWM1IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC15</name>
          <displayName>IPC15</displayName>
          <description>IPC15</description>
          <addressOffset>0xc2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4440</resetValue>
          <resetMask>0x7770</resetMask>
          <fields>
            <field>
              <name>DMA5IP</name>
              <description>DMA5IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC16</name>
          <displayName>IPC16</displayName>
          <description>IPC16</description>
          <addressOffset>0xc4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4440</resetValue>
          <resetMask>0x7770</resetMask>
          <fields>
            <field>
              <name>U1EIP</name>
              <description>U1EIP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC17</name>
          <displayName>IPC17</displayName>
          <description>IPC17</description>
          <addressOffset>0xc6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x444</resetValue>
          <resetMask>0x777</resetMask>
          <fields>
            <field>
              <name>DMA6IP</name>
              <description>DMA6IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC18</name>
          <displayName>IPC18</displayName>
          <description>IPC18</description>
          <addressOffset>0xc8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4440</resetValue>
          <resetMask>0x7770</resetMask>
          <fields>
            <field>
              <name>PWM2IP</name>
              <description>PWM2IP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTTREG</name>
          <displayName>INTTREG</displayName>
          <description>INTTREG</description>
          <addressOffset>0xe0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf7f</resetMask>
          <fields>
            <field>
              <name>VECNUM</name>
              <description>VECNUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1</name>
          <displayName>TMR1</displayName>
          <description>TMR1</description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR1</name>
              <description>TMR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1</name>
          <displayName>PR1</displayName>
          <description>PR1</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR1</name>
              <description>PR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CON</name>
          <displayName>T1CON</displayName>
          <description>T1CON</description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa076</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR2</name>
          <displayName>TMR2</displayName>
          <description>TMR2</description>
          <addressOffset>0x106</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR2</name>
              <description>TMR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR3HLD</name>
          <displayName>TMR3HLD</displayName>
          <description>TMR3HLD</description>
          <addressOffset>0x108</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR3HLD</name>
              <description>TMR3HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR3</name>
          <displayName>TMR3</displayName>
          <description>TMR3</description>
          <addressOffset>0x10a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR3</name>
              <description>TMR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR2</name>
          <displayName>PR2</displayName>
          <description>PR2</description>
          <addressOffset>0x10c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR2</name>
              <description>PR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR3</name>
          <displayName>PR3</displayName>
          <description>PR3</description>
          <addressOffset>0x10e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR3</name>
              <description>PR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CON</name>
          <displayName>T2CON</displayName>
          <description>T2CON</description>
          <addressOffset>0x110</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa07a</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T3CON</name>
          <displayName>T3CON</displayName>
          <description>T3CON</description>
          <addressOffset>0x112</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa072</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR4</name>
          <displayName>TMR4</displayName>
          <description>TMR4</description>
          <addressOffset>0x114</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR4</name>
              <description>TMR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR5HLD</name>
          <displayName>TMR5HLD</displayName>
          <description>TMR5HLD</description>
          <addressOffset>0x116</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR5HLD</name>
              <description>TMR5HLD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR5</name>
          <displayName>TMR5</displayName>
          <description>TMR5</description>
          <addressOffset>0x118</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>TMR5</name>
              <description>TMR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR4</name>
          <displayName>PR4</displayName>
          <description>PR4</description>
          <addressOffset>0x11a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR4</name>
              <description>PR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR5</name>
          <displayName>PR5</displayName>
          <description>PR5</description>
          <addressOffset>0x11c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>PR5</name>
              <description>PR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T4CON</name>
          <displayName>T4CON</displayName>
          <description>T4CON</description>
          <addressOffset>0x11e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa07a</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T5CON</name>
          <displayName>T5CON</displayName>
          <description>T5CON</description>
          <addressOffset>0x120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa072</resetMask>
          <fields>
            <field>
              <name>TCS</name>
              <description>TCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1BUF</name>
          <displayName>IC1BUF</displayName>
          <description>IC1BUF</description>
          <addressOffset>0x140</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC1BUF</name>
              <description>IC1BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CON</name>
          <displayName>IC1CON</displayName>
          <description>IC1CON</description>
          <addressOffset>0x142</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2BUF</name>
          <displayName>IC2BUF</displayName>
          <description>IC2BUF</description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC2BUF</name>
              <description>IC2BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC2CON</name>
          <displayName>IC2CON</displayName>
          <description>IC2CON</description>
          <addressOffset>0x146</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7BUF</name>
          <displayName>IC7BUF</displayName>
          <description>IC7BUF</description>
          <addressOffset>0x158</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC7BUF</name>
              <description>IC7BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC7CON</name>
          <displayName>IC7CON</displayName>
          <description>IC7CON</description>
          <addressOffset>0x15a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8BUF</name>
          <displayName>IC8BUF</displayName>
          <description>IC8BUF</description>
          <addressOffset>0x15c</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>IC8BUF</name>
              <description>IC8BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC8CON</name>
          <displayName>IC8CON</displayName>
          <description>IC8CON</description>
          <addressOffset>0x15e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x20ff</resetMask>
          <fields>
            <field>
              <name>ICM</name>
              <description>ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1RS</name>
          <displayName>OC1RS</displayName>
          <description>OC1RS</description>
          <addressOffset>0x180</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC1RS</name>
              <description>OC1RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1R</name>
          <displayName>OC1R</displayName>
          <description>OC1R</description>
          <addressOffset>0x182</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC1R</name>
              <description>OC1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
