xsession/openocd/svd/microchip/dspic33fj128mc802.svd
        <register>
          <name>OC1CON</name>
          <displayName>OC1CON</displayName>
          <description>OC1CON</description>
          <addressOffset>0x184</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2RS</name>
          <displayName>OC2RS</displayName>
          <description>OC2RS</description>
          <addressOffset>0x186</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC2RS</name>
              <description>OC2RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2R</name>
          <displayName>OC2R</displayName>
          <description>OC2R</description>
          <addressOffset>0x188</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC2R</name>
              <description>OC2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2CON</name>
          <displayName>OC2CON</displayName>
          <description>OC2CON</description>
          <addressOffset>0x18a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RS</name>
          <displayName>OC3RS</displayName>
          <description>OC3RS</description>
          <addressOffset>0x18c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC3RS</name>
              <description>OC3RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3R</name>
          <displayName>OC3R</displayName>
          <description>OC3R</description>
          <addressOffset>0x18e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC3R</name>
              <description>OC3R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3CON</name>
          <displayName>OC3CON</displayName>
          <description>OC3CON</description>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4RS</name>
          <displayName>OC4RS</displayName>
          <description>OC4RS</description>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC4RS</name>
              <description>OC4RS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4R</name>
          <displayName>OC4R</displayName>
          <description>OC4R</description>
          <addressOffset>0x194</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>OC4R</name>
              <description>OC4R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4CON</name>
          <displayName>OC4CON</displayName>
          <description>OC4CON</description>
          <addressOffset>0x196</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x201f</resetMask>
          <fields>
            <field>
              <name>OCM</name>
              <description>OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1TCON</name>
          <displayName>P1TCON</displayName>
          <description>P1TCON</description>
          <addressOffset>0x1c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa0ff</resetMask>
          <fields>
            <field>
              <name>PTMOD</name>
              <description>PTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1TMR</name>
          <displayName>P1TMR</displayName>
          <description>P1TMR</description>
          <addressOffset>0x1c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTMR</name>
              <description>PTMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1TPER</name>
          <displayName>P1TPER</displayName>
          <description>P1TPER</description>
          <addressOffset>0x1c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTPER</name>
              <description>PTPER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1SECMP</name>
          <displayName>P1SECMP</displayName>
          <description>P1SECMP</description>
          <addressOffset>0x1c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SEVTCMP</name>
              <description>SEVTCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM1CON1</name>
          <displayName>PWM1CON1</displayName>
          <description>PWM1CON1</description>
          <addressOffset>0x1c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x777</resetMask>
          <fields>
            <field>
              <name>PEN1L</name>
              <description>PEN1L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM1CON2</name>
          <displayName>PWM1CON2</displayName>
          <description>PWM1CON2</description>
          <addressOffset>0x1ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf07</resetMask>
          <fields>
            <field>
              <name>UDIS</name>
              <description>UDIS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTCON1</name>
          <displayName>DTCON1</displayName>
          <description>DTCON1</description>
          <addressOffset>0x1cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DTA</name>
              <description>DTA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTCON2</name>
          <displayName>DTCON2</displayName>
          <description>DTCON2</description>
          <addressOffset>0x1ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>
          <fields>
            <field>
              <name>DTS1I</name>
              <description>DTS1I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTACON</name>
          <displayName>FLTACON</displayName>
          <description>FLTACON</description>
          <addressOffset>0x1d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f87</resetMask>
          <fields>
            <field>
              <name>FAEN1</name>
              <description>FAEN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OVDCON</name>
          <displayName>OVDCON</displayName>
          <description>OVDCON</description>
          <addressOffset>0x1d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3f00</resetValue>
          <resetMask>0x3f3f</resetMask>
          <fields>
            <field>
              <name>POUT1L</name>
              <description>POUT1L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DC1</name>
          <displayName>P1DC1</displayName>
          <description>P1DC1</description>
          <addressOffset>0x1d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC1</name>
              <description>PDC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DC2</name>
          <displayName>P1DC2</displayName>
          <description>P1DC2</description>
          <addressOffset>0x1d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC2</name>
              <description>PDC2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1DC3</name>
          <displayName>P1DC3</displayName>
          <description>P1DC3</description>
          <addressOffset>0x1da</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PDC3</name>
              <description>PDC3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI1CON</name>
          <displayName>QEI1CON</displayName>
          <description>QEI1CON</description>
          <addressOffset>0x1e0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>UPDN_SRC</name>
              <description>UPDN_SRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLT1CON</name>
          <displayName>DFLT1CON</displayName>
          <description>DFLT1CON</description>
          <addressOffset>0x1e2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f0</resetMask>
          <fields>
            <field>
              <name>QECK</name>
              <description>QECK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS1CNT</name>
          <displayName>POS1CNT</displayName>
          <description>POS1CNT</description>
          <addressOffset>0x1e4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>POS1CNT</name>
              <description>POS1CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAX1CNT</name>
          <displayName>MAX1CNT</displayName>
          <description>MAX1CNT</description>
          <addressOffset>0x1e6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>MAX1CNT</name>
              <description>MAX1CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QEI2CON</name>
          <displayName>QEI2CON</displayName>
          <description>QEI2CON</description>
          <addressOffset>0x1f0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>UPDN_SRC</name>
              <description>UPDN_SRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLT2CON</name>
          <displayName>DFLT2CON</displayName>
          <description>DFLT2CON</description>
          <addressOffset>0x1f2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7f0</resetMask>
          <fields>
            <field>
              <name>QECK</name>
              <description>QECK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS2CNT</name>
          <displayName>POS2CNT</displayName>
          <description>POS2CNT</description>
          <addressOffset>0x1f4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>POS2CNT</name>
              <description>POS2CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAX2CNT</name>
          <displayName>MAX2CNT</displayName>
          <description>MAX2CNT</description>
          <addressOffset>0x1f6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>MAX2CNT</name>
              <description>MAX2CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1RCV</name>
          <displayName>I2C1RCV</displayName>
          <description>I2C1RCV</description>
          <addressOffset>0x200</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2C1RCV</name>
              <description>I2C1RCV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1TRN</name>
          <displayName>I2C1TRN</displayName>
          <description>I2C1TRN</description>
          <addressOffset>0x202</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0xff</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>I2C1TRN</name>
              <description>I2C1TRN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1BRG</name>
          <displayName>I2C1BRG</displayName>
          <description>I2C1BRG</description>
          <addressOffset>0x204</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>I2C1BRG</name>
              <description>I2C1BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1CON</name>
          <displayName>I2C1CON</displayName>
          <description>I2C1CON</description>
          <addressOffset>0x206</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>SEN</name>
              <description>SEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1STAT</name>
          <displayName>I2C1STAT</displayName>
          <description>I2C1STAT</description>
          <addressOffset>0x208</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc7ff</resetMask>
          <fields>
            <field>
              <name>TBF</name>
              <description>TBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1ADD</name>
          <displayName>I2C1ADD</displayName>
          <description>I2C1ADD</description>
          <addressOffset>0x20a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>I2C1ADD</name>
              <description>I2C1ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1MSK</name>
          <displayName>I2C1MSK</displayName>
          <description>I2C1MSK</description>
          <addressOffset>0x20c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>AMSK</name>
              <description>AMSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1MODE</name>
          <displayName>U1MODE</displayName>
          <description>U1MODE</description>
          <addressOffset>0x220</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbbff</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1STA</name>
          <displayName>U1STA</displayName>
          <description>U1STA</description>
          <addressOffset>0x222</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xefff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TXREG</name>
          <displayName>U1TXREG</displayName>
          <description>U1TXREG</description>
          <addressOffset>0x224</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>UTXREG0</name>
              <description>UTXREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
