xsession/openocd/svd/microchip/dspic33fj128mc802.svd
        <register>
          <name>DMA1STA</name>
          <displayName>DMA1STA</displayName>
          <description>DMA1STA</description>
          <addressOffset>0x390</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STB</name>
          <displayName>DMA1STB</displayName>
          <description>DMA1STB</description>
          <addressOffset>0x392</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1PAD</name>
          <displayName>DMA1PAD</displayName>
          <description>DMA1PAD</description>
          <addressOffset>0x394</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1CNT</name>
          <displayName>DMA1CNT</displayName>
          <description>DMA1CNT</description>
          <addressOffset>0x396</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2CON</name>
          <displayName>DMA2CON</displayName>
          <description>DMA2CON</description>
          <addressOffset>0x398</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2REQ</name>
          <displayName>DMA2REQ</displayName>
          <description>DMA2REQ</description>
          <addressOffset>0x39a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STA</name>
          <displayName>DMA2STA</displayName>
          <description>DMA2STA</description>
          <addressOffset>0x39c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STB</name>
          <displayName>DMA2STB</displayName>
          <description>DMA2STB</description>
          <addressOffset>0x39e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2PAD</name>
          <displayName>DMA2PAD</displayName>
          <description>DMA2PAD</description>
          <addressOffset>0x3a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2CNT</name>
          <displayName>DMA2CNT</displayName>
          <description>DMA2CNT</description>
          <addressOffset>0x3a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3CON</name>
          <displayName>DMA3CON</displayName>
          <description>DMA3CON</description>
          <addressOffset>0x3a4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3REQ</name>
          <displayName>DMA3REQ</displayName>
          <description>DMA3REQ</description>
          <addressOffset>0x3a6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STA</name>
          <displayName>DMA3STA</displayName>
          <description>DMA3STA</description>
          <addressOffset>0x3a8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STB</name>
          <displayName>DMA3STB</displayName>
          <description>DMA3STB</description>
          <addressOffset>0x3aa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3PAD</name>
          <displayName>DMA3PAD</displayName>
          <description>DMA3PAD</description>
          <addressOffset>0x3ac</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3CNT</name>
          <displayName>DMA3CNT</displayName>
          <description>DMA3CNT</description>
          <addressOffset>0x3ae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4CON</name>
          <displayName>DMA4CON</displayName>
          <description>DMA4CON</description>
          <addressOffset>0x3b0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4REQ</name>
          <displayName>DMA4REQ</displayName>
          <description>DMA4REQ</description>
          <addressOffset>0x3b2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4STA</name>
          <displayName>DMA4STA</displayName>
          <description>DMA4STA</description>
          <addressOffset>0x3b4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4STB</name>
          <displayName>DMA4STB</displayName>
          <description>DMA4STB</description>
          <addressOffset>0x3b6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4PAD</name>
          <displayName>DMA4PAD</displayName>
          <description>DMA4PAD</description>
          <addressOffset>0x3b8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4CNT</name>
          <displayName>DMA4CNT</displayName>
          <description>DMA4CNT</description>
          <addressOffset>0x3ba</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5CON</name>
          <displayName>DMA5CON</displayName>
          <description>DMA5CON</description>
          <addressOffset>0x3bc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5REQ</name>
          <displayName>DMA5REQ</displayName>
          <description>DMA5REQ</description>
          <addressOffset>0x3be</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5STA</name>
          <displayName>DMA5STA</displayName>
          <description>DMA5STA</description>
          <addressOffset>0x3c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5STB</name>
          <displayName>DMA5STB</displayName>
          <description>DMA5STB</description>
          <addressOffset>0x3c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5PAD</name>
          <displayName>DMA5PAD</displayName>
          <description>DMA5PAD</description>
          <addressOffset>0x3c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5CNT</name>
          <displayName>DMA5CNT</displayName>
          <description>DMA5CNT</description>
          <addressOffset>0x3c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6CON</name>
          <displayName>DMA6CON</displayName>
          <description>DMA6CON</description>
          <addressOffset>0x3c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6REQ</name>
          <displayName>DMA6REQ</displayName>
          <description>DMA6REQ</description>
          <addressOffset>0x3ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6STA</name>
          <displayName>DMA6STA</displayName>
          <description>DMA6STA</description>
          <addressOffset>0x3cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6STB</name>
          <displayName>DMA6STB</displayName>
          <description>DMA6STB</description>
          <addressOffset>0x3ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6PAD</name>
          <displayName>DMA6PAD</displayName>
          <description>DMA6PAD</description>
          <addressOffset>0x3d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6CNT</name>
          <displayName>DMA6CNT</displayName>
          <description>DMA6CNT</description>
          <addressOffset>0x3d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7CON</name>
          <displayName>DMA7CON</displayName>
          <description>DMA7CON</description>
          <addressOffset>0x3d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7REQ</name>
          <displayName>DMA7REQ</displayName>
          <description>DMA7REQ</description>
          <addressOffset>0x3d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7STA</name>
          <displayName>DMA7STA</displayName>
          <description>DMA7STA</description>
          <addressOffset>0x3d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7STB</name>
          <displayName>DMA7STB</displayName>
          <description>DMA7STB</description>
          <addressOffset>0x3da</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7PAD</name>
          <displayName>DMA7PAD</displayName>
          <description>DMA7PAD</description>
          <addressOffset>0x3dc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7CNT</name>
          <displayName>DMA7CNT</displayName>
          <description>DMA7CNT</description>
          <addressOffset>0x3de</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACS0</name>
          <displayName>DMACS0</displayName>
          <description>DMACS0</description>
          <addressOffset>0x3e0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XWCOL</name>
              <description>XWCOL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
