xsession/openocd/svd/microchip/dspic33fj128mc802.svd
        <register>
          <name>DMACS1</name>
          <displayName>DMACS1</displayName>
          <description>DMACS1</description>
          <addressOffset>0x3e2</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0xf00</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>PPST0</name>
              <description>PPST0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSADR</name>
          <displayName>DSADR</displayName>
          <description>DSADR</description>
          <addressOffset>0x3e4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DSADR</name>
              <description>DSADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CTRL1</name>
          <displayName>C1CTRL1</displayName>
          <description>C1CTRL1</description>
          <addressOffset>0x400</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0x300</resetMask>
          <fields>
            <field>
              <name>WIN</name>
              <description>WIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CTRL2</name>
          <displayName>C1CTRL2</displayName>
          <description>C1CTRL2</description>
          <addressOffset>0x402</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DNCNT</name>
              <description>DNCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1VEC</name>
          <displayName>C1VEC</displayName>
          <description>C1VEC</description>
          <addressOffset>0x404</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>ICODE</name>
              <description>ICODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FCTRL</name>
          <displayName>C1FCTRL</displayName>
          <description>C1FCTRL</description>
          <addressOffset>0x406</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FSA</name>
              <description>FSA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFO</name>
          <displayName>C1FIFO</displayName>
          <description>C1FIFO</description>
          <addressOffset>0x408</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FNRB</name>
              <description>FNRB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1INTF</name>
          <displayName>C1INTF</displayName>
          <description>C1INTF</description>
          <addressOffset>0x40a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TBIF</name>
              <description>TBIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1INTE</name>
          <displayName>C1INTE</displayName>
          <description>C1INTE</description>
          <addressOffset>0x40c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TBIE</name>
              <description>TBIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1EC</name>
          <displayName>C1EC</displayName>
          <description>C1EC</description>
          <addressOffset>0x40e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RERRCNT</name>
              <description>RERRCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG1</name>
          <displayName>C1CFG1</displayName>
          <description>C1CFG1</description>
          <addressOffset>0x410</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG2</name>
          <displayName>C1CFG2</displayName>
          <description>C1CFG2</description>
          <addressOffset>0x412</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PRSEG</name>
              <description>PRSEG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FEN1</name>
          <displayName>C1FEN1</displayName>
          <description>C1FEN1</description>
          <addressOffset>0x414</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTEN</name>
              <description>FLTEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FMSKSEL1</name>
          <displayName>C1FMSKSEL1</displayName>
          <description>C1FMSKSEL1</description>
          <addressOffset>0x418</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F0MSK</name>
              <description>F0MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FMSKSEL2</name>
          <displayName>C1FMSKSEL2</displayName>
          <description>C1FMSKSEL2</description>
          <addressOffset>0x41a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8MSK</name>
              <description>F8MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL1</name>
          <displayName>C1RXFUL1</displayName>
          <description>C1RXFUL1</description>
          <addressOffset>0x420</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL0</name>
              <description>RXFUL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL2</name>
          <displayName>C1RXFUL2</displayName>
          <description>C1RXFUL2</description>
          <addressOffset>0x422</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL16</name>
              <description>RXFUL16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT3</name>
          <displayName>C1BUFPNT3</displayName>
          <description>C1BUFPNT3</description>
          <addressOffset>0x424</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8BP</name>
              <description>F8BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT4</name>
          <displayName>C1BUFPNT4</displayName>
          <description>C1BUFPNT4</description>
          <addressOffset>0x426</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F12BP</name>
              <description>F12BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF1</name>
          <displayName>C1RXOVF1</displayName>
          <description>C1RXOVF1</description>
          <addressOffset>0x428</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF0</name>
              <description>RXOVF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF2</name>
          <displayName>C1RXOVF2</displayName>
          <description>C1RXOVF2</description>
          <addressOffset>0x42a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF16</name>
              <description>RXOVF16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR01CON</name>
          <displayName>C1TR01CON</displayName>
          <description>C1TR01CON</description>
          <addressOffset>0x430</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX0PRI</name>
              <description>TX0PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR23CON</name>
          <displayName>C1TR23CON</displayName>
          <description>C1TR23CON</description>
          <addressOffset>0x432</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX2PRI</name>
              <description>TX2PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR45CON</name>
          <displayName>C1TR45CON</displayName>
          <description>C1TR45CON</description>
          <addressOffset>0x434</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX4PRI</name>
              <description>TX4PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR67CON</name>
          <displayName>C1TR67CON</displayName>
          <description>C1TR67CON</description>
          <addressOffset>0x436</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX6PRI</name>
              <description>TX6PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2SID</name>
          <displayName>C1RXM2SID</displayName>
          <description>C1RXM2SID</description>
          <addressOffset>0x438</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2EID</name>
          <displayName>C1RXM2EID</displayName>
          <description>C1RXM2EID</description>
          <addressOffset>0x43a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXD</name>
          <displayName>C1RXD</displayName>
          <description>C1RXD</description>
          <addressOffset>0x440</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>C1RXD</name>
              <description>C1RXD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TXD</name>
          <displayName>C1TXD</displayName>
          <description>C1TXD</description>
          <addressOffset>0x442</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfffe</resetMask>
          <fields>
            <field>
              <name>C1TXD</name>
              <description>C1TXD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1SID</name>
          <displayName>C1RXF1SID</displayName>
          <description>C1RXF1SID</description>
          <addressOffset>0x444</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1EID</name>
          <displayName>C1RXF1EID</displayName>
          <description>C1RXF1EID</description>
          <addressOffset>0x446</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2SID</name>
          <displayName>C1RXF2SID</displayName>
          <description>C1RXF2SID</description>
          <addressOffset>0x448</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2EID</name>
          <displayName>C1RXF2EID</displayName>
          <description>C1RXF2EID</description>
          <addressOffset>0x44a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3EID</name>
          <displayName>C1RXF3EID</displayName>
          <description>C1RXF3EID</description>
          <addressOffset>0x44e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4SID</name>
          <displayName>C1RXF4SID</displayName>
          <description>C1RXF4SID</description>
          <addressOffset>0x450</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4EID</name>
          <displayName>C1RXF4EID</displayName>
          <description>C1RXF4EID</description>
          <addressOffset>0x452</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5SID</name>
          <displayName>C1RXF5SID</displayName>
          <description>C1RXF5SID</description>
          <addressOffset>0x454</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6SID</name>
          <displayName>C1RXF6SID</displayName>
          <description>C1RXF6SID</description>
          <addressOffset>0x458</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6EID</name>
          <displayName>C1RXF6EID</displayName>
          <description>C1RXF6EID</description>
          <addressOffset>0x45a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7SID</name>
          <displayName>C1RXF7SID</displayName>
          <description>C1RXF7SID</description>
          <addressOffset>0x45c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7EID</name>
          <displayName>C1RXF7EID</displayName>
          <description>C1RXF7EID</description>
          <addressOffset>0x45e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
