xsession/openocd/svd/microchip/dspic33fj128mc802.svd
        <register>
          <name>C1RXF8SID</name>
          <displayName>C1RXF8SID</displayName>
          <description>C1RXF8SID</description>
          <addressOffset>0x460</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF8EID</name>
          <displayName>C1RXF8EID</displayName>
          <description>C1RXF8EID</description>
          <addressOffset>0x462</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF9SID</name>
          <displayName>C1RXF9SID</displayName>
          <description>C1RXF9SID</description>
          <addressOffset>0x464</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF9EID</name>
          <displayName>C1RXF9EID</displayName>
          <description>C1RXF9EID</description>
          <addressOffset>0x466</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF10SID</name>
          <displayName>C1RXF10SID</displayName>
          <description>C1RXF10SID</description>
          <addressOffset>0x468</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF10EID</name>
          <displayName>C1RXF10EID</displayName>
          <description>C1RXF10EID</description>
          <addressOffset>0x46a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF11SID</name>
          <displayName>C1RXF11SID</displayName>
          <description>C1RXF11SID</description>
          <addressOffset>0x46c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF11EID</name>
          <displayName>C1RXF11EID</displayName>
          <description>C1RXF11EID</description>
          <addressOffset>0x46e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF12SID</name>
          <displayName>C1RXF12SID</displayName>
          <description>C1RXF12SID</description>
          <addressOffset>0x470</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF12EID</name>
          <displayName>C1RXF12EID</displayName>
          <description>C1RXF12EID</description>
          <addressOffset>0x472</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF13SID</name>
          <displayName>C1RXF13SID</displayName>
          <description>C1RXF13SID</description>
          <addressOffset>0x474</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF13EID</name>
          <displayName>C1RXF13EID</displayName>
          <description>C1RXF13EID</description>
          <addressOffset>0x476</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF14SID</name>
          <displayName>C1RXF14SID</displayName>
          <description>C1RXF14SID</description>
          <addressOffset>0x478</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF14EID</name>
          <displayName>C1RXF14EID</displayName>
          <description>C1RXF14EID</description>
          <addressOffset>0x47a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF15SID</name>
          <displayName>C1RXF15SID</displayName>
          <description>C1RXF15SID</description>
          <addressOffset>0x47c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF15EID</name>
          <displayName>C1RXF15EID</displayName>
          <description>C1RXF15EID</description>
          <addressOffset>0x47e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2TCON</name>
          <displayName>P2TCON</displayName>
          <description>P2TCON</description>
          <addressOffset>0x5c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa0ff</resetMask>
          <fields>
            <field>
              <name>PTMOD</name>
              <description>PTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2TMR</name>
          <displayName>P2TMR</displayName>
          <description>P2TMR</description>
          <addressOffset>0x5c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTMR</name>
              <description>PTMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2TPER</name>
          <displayName>P2TPER</displayName>
          <description>P2TPER</description>
          <addressOffset>0x5c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTPER</name>
              <description>PTPER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2SECMP</name>
          <displayName>P2SECMP</displayName>
          <description>P2SECMP</description>
          <addressOffset>0x5c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SEVTCMP</name>
              <description>SEVTCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM2CON1</name>
          <displayName>PWM2CON1</displayName>
          <description>PWM2CON1</description>
          <addressOffset>0x5c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x111</resetMask>
          <fields>
            <field>
              <name>PEN1L</name>
              <description>PEN1L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM2CON2</name>
          <displayName>PWM2CON2</displayName>
          <description>PWM2CON2</description>
          <addressOffset>0x5ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf07</resetMask>
          <fields>
            <field>
              <name>UDIS</name>
              <description>UDIS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DTCON1</name>
          <displayName>P2DTCON1</displayName>
          <description>P2DTCON1</description>
          <addressOffset>0x5cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DTA</name>
              <description>DTA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DTCON2</name>
          <displayName>P2DTCON2</displayName>
          <description>P2DTCON2</description>
          <addressOffset>0x5ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>DTS1I</name>
              <description>DTS1I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2FLTACON</name>
          <displayName>P2FLTACON</displayName>
          <description>P2FLTACON</description>
          <addressOffset>0x5d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x381</resetMask>
          <fields>
            <field>
              <name>FAEN1</name>
              <description>FAEN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2OVDCON</name>
          <displayName>P2OVDCON</displayName>
          <description>P2OVDCON</description>
          <addressOffset>0x5d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0x303</resetMask>
          <fields>
            <field>
              <name>POUT1L</name>
              <description>POUT1L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DC1</name>
          <displayName>P2DC1</displayName>
          <description>P2DC1</description>
          <addressOffset>0x5d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>P2DC1</name>
              <description>P2DC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCON</name>
          <displayName>PMCON</displayName>
          <description>PMCON</description>
          <addressOffset>0x600</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfef</resetMask>
          <fields>
            <field>
              <name>RDSP</name>
              <description>RDSP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMODE</name>
          <displayName>PMMODE</displayName>
          <description>PMMODE</description>
          <addressOffset>0x602</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WAITE</name>
              <description>WAITE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMADDR</name>
          <displayName>PMADDR</displayName>
          <description>PMADDR</description>
          <addressOffset>0x604</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDOUT2</name>
          <displayName>PMDOUT2</displayName>
          <description>PMDOUT2</description>
          <addressOffset>0x606</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDIN1</name>
          <displayName>PMDIN1</displayName>
          <description>PMDIN1</description>
          <addressOffset>0x608</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDIN2</name>
          <displayName>PMDIN2</displayName>
          <description>PMDIN2</description>
          <addressOffset>0x60a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTEN</name>
              <description>PTEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMAEN</name>
          <displayName>PMAEN</displayName>
          <description>PMAEN</description>
          <addressOffset>0x60c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x4000</resetMask>
          <fields>
            <field>
              <name>PTEN</name>
              <description>PTEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMSTAT</name>
          <displayName>PMSTAT</displayName>
          <description>PMSTAT</description>
          <addressOffset>0x60e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcfcf</resetMask>
          <fields>
            <field>
              <name>OB0E</name>
              <description>OB0E</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMVAL</name>
          <displayName>ALRMVAL</displayName>
          <description>ALRMVAL</description>
          <addressOffset>0x620</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ALRMVAL</name>
              <description>ALRMVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALCFGRPT</name>
          <displayName>ALCFGRPT</displayName>
          <description>ALCFGRPT</description>
          <addressOffset>0x622</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ARPT</name>
              <description>ARPT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCVAL</name>
          <displayName>RTCVAL</displayName>
          <description>RTCVAL</description>
          <addressOffset>0x624</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RTCVAL</name>
              <description>RTCVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCFGCAL</name>
          <displayName>RCFGCAL</displayName>
          <description>RCFGCAL</description>
          <addressOffset>0x626</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>CAL</name>
              <description>CAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMCON</name>
          <displayName>CMCON</displayName>
          <description>CMCON</description>
          <addressOffset>0x630</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>C1POS</name>
              <description>C1POS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCON</name>
          <displayName>CVRCON</displayName>
          <description>CVRCON</description>
          <addressOffset>0x632</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>CVR</name>
              <description>CVR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
