xsession/openocd/svd/microchip/dspic33fj128mc802.svd
        <register>
          <name>CRCCON</name>
          <displayName>CRCCON</displayName>
          <description>CRCCON</description>
          <addressOffset>0x640</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>PLEN</name>
              <description>PLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCXOR</name>
          <displayName>CRCXOR</displayName>
          <description>CRCXOR</description>
          <addressOffset>0x642</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CRCXOR</name>
              <description>CRCXOR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDAT</name>
          <displayName>CRCDAT</displayName>
          <description>CRCDAT</description>
          <addressOffset>0x644</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CRCDAT</name>
              <description>CRCDAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCWDAT</name>
          <displayName>CRCWDAT</displayName>
          <description>CRCWDAT</description>
          <addressOffset>0x646</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CRCWDAT</name>
              <description>CRCWDAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR0</name>
          <displayName>RPINR0</displayName>
          <description>RPINR0</description>
          <addressOffset>0x680</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f00</resetValue>
          <resetMask>0x1f00</resetMask>
          <fields>
            <field>
              <name>INT1R</name>
              <description>INT1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR1</name>
          <displayName>RPINR1</displayName>
          <description>RPINR1</description>
          <addressOffset>0x682</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>INT2R</name>
              <description>INT2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR3</name>
          <displayName>RPINR3</displayName>
          <description>RPINR3</description>
          <addressOffset>0x686</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>T2CKR</name>
              <description>T2CKR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR4</name>
          <displayName>RPINR4</displayName>
          <description>RPINR4</description>
          <addressOffset>0x688</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>T4CKR</name>
              <description>T4CKR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR7</name>
          <displayName>RPINR7</displayName>
          <description>RPINR7</description>
          <addressOffset>0x68e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>IC1R</name>
              <description>IC1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR10</name>
          <displayName>RPINR10</displayName>
          <description>RPINR10</description>
          <addressOffset>0x694</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>IC7R</name>
              <description>IC7R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR11</name>
          <displayName>RPINR11</displayName>
          <description>RPINR11</description>
          <addressOffset>0x696</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>OCFAR</name>
              <description>OCFAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR12</name>
          <displayName>RPINR12</displayName>
          <description>RPINR12</description>
          <addressOffset>0x698</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>FLTA1R</name>
              <description>FLTA1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR13</name>
          <displayName>RPINR13</displayName>
          <description>RPINR13</description>
          <addressOffset>0x69a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>FLTA2R</name>
              <description>FLTA2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR14</name>
          <displayName>RPINR14</displayName>
          <description>RPINR14</description>
          <addressOffset>0x69c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>QEA1R</name>
              <description>QEA1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR15</name>
          <displayName>RPINR15</displayName>
          <description>RPINR15</description>
          <addressOffset>0x69e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>INDX1R</name>
              <description>INDX1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR16</name>
          <displayName>RPINR16</displayName>
          <description>RPINR16</description>
          <addressOffset>0x6a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>QEA2R</name>
              <description>QEA2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR17</name>
          <displayName>RPINR17</displayName>
          <description>RPINR17</description>
          <addressOffset>0x6a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>INDX2R</name>
              <description>INDX2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR18</name>
          <displayName>RPINR18</displayName>
          <description>RPINR18</description>
          <addressOffset>0x6a4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>U1RXR</name>
              <description>U1RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR19</name>
          <displayName>RPINR19</displayName>
          <description>RPINR19</description>
          <addressOffset>0x6a6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>U2RXR</name>
              <description>U2RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR20</name>
          <displayName>RPINR20</displayName>
          <description>RPINR20</description>
          <addressOffset>0x6a8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>SDI1R</name>
              <description>SDI1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR21</name>
          <displayName>RPINR21</displayName>
          <description>RPINR21</description>
          <addressOffset>0x6aa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>SS1R</name>
              <description>SS1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR22</name>
          <displayName>RPINR22</displayName>
          <description>RPINR22</description>
          <addressOffset>0x6ac</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>SDI2R</name>
              <description>SDI2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR23</name>
          <displayName>RPINR23</displayName>
          <description>RPINR23</description>
          <addressOffset>0x6ae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>SS2R</name>
              <description>SS2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR26</name>
          <displayName>RPINR26</displayName>
          <description>RPINR26</description>
          <addressOffset>0x6b4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>C1RXR</name>
              <description>C1RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR0</name>
          <displayName>RPOR0</displayName>
          <description>RPOR0</description>
          <addressOffset>0x6c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP0R</name>
              <description>RP0R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR1</name>
          <displayName>RPOR1</displayName>
          <description>RPOR1</description>
          <addressOffset>0x6c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP2R</name>
              <description>RP2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR2</name>
          <displayName>RPOR2</displayName>
          <description>RPOR2</description>
          <addressOffset>0x6c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP4R</name>
              <description>RP4R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR3</name>
          <displayName>RPOR3</displayName>
          <description>RPOR3</description>
          <addressOffset>0x6c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP6R</name>
              <description>RP6R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR4</name>
          <displayName>RPOR4</displayName>
          <description>RPOR4</description>
          <addressOffset>0x6c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP8R</name>
              <description>RP8R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR5</name>
          <displayName>RPOR5</displayName>
          <description>RPOR5</description>
          <addressOffset>0x6ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP10R</name>
              <description>RP10R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR6</name>
          <displayName>RPOR6</displayName>
          <description>RPOR6</description>
          <addressOffset>0x6cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP12R</name>
              <description>RP12R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR7</name>
          <displayName>RPOR7</displayName>
          <description>RPOR7</description>
          <addressOffset>0x6ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP14R</name>
              <description>RP14R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR8</name>
          <displayName>RPOR8</displayName>
          <description>RPOR8</description>
          <addressOffset>0x6d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP16R</name>
              <description>RP16R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR9</name>
          <displayName>RPOR9</displayName>
          <description>RPOR9</description>
          <addressOffset>0x6d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP18R</name>
              <description>RP18R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR10</name>
          <displayName>RPOR10</displayName>
          <description>RPOR10</description>
          <addressOffset>0x6d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP20R</name>
              <description>RP20R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR11</name>
          <displayName>RPOR11</displayName>
          <description>RPOR11</description>
          <addressOffset>0x6d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP22R</name>
              <description>RP22R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR12</name>
          <displayName>RPOR12</displayName>
          <description>RPOR12</description>
          <addressOffset>0x6d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP24R</name>
              <description>RP24R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCON</name>
          <displayName>RCON</displayName>
          <description>RCON</description>
          <addressOffset>0x740</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xc3ff</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>POR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCON</name>
          <displayName>OSCCON</displayName>
          <description>OSCCON</description>
          <addressOffset>0x742</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x70eb</resetMask>
          <fields>
            <field>
              <name>OSWEN</name>
              <description>OSWEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <displayName>CLKDIV</displayName>
          <description>CLKDIV</description>
          <addressOffset>0x744</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3040</resetValue>
          <resetMask>0xffdf</resetMask>
          <fields>
            <field>
              <name>PLLPRE</name>
              <description>PLLPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFBD</name>
          <displayName>PLLFBD</displayName>
          <description>PLLFBD</description>
          <addressOffset>0x746</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>PLLDIV</name>
              <description>PLLDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
