xsession/openocd/svd/microchip/dspic33fj128mc802.svd
        <register>
          <name>OSCTUN</name>
          <displayName>OSCTUN</displayName>
          <description>OSCTUN</description>
          <addressOffset>0x748</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>
          <fields>
            <field>
              <name>TUN</name>
              <description>TUN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLKCON</name>
          <displayName>ACLKCON</displayName>
          <description>ACLKCON</description>
          <addressOffset>0x74a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ASRCSEL</name>
              <description>ASRCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRAM</name>
          <displayName>BSRAM</displayName>
          <description>BSRAM</description>
          <addressOffset>0x750</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>RL_BSR</name>
              <description>RL_BSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSRAM</name>
          <displayName>SSRAM</displayName>
          <description>SSRAM</description>
          <addressOffset>0x752</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>RL_SSR</name>
              <description>RL_SSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCON</name>
          <displayName>NVMCON</displayName>
          <description>NVMCON</description>
          <addressOffset>0x760</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe04f</resetMask>
          <fields>
            <field>
              <name>NVMOP</name>
              <description>NVMOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <displayName>NVMKEY</displayName>
          <description>NVMKEY</description>
          <addressOffset>0x766</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>NVMKEY</name>
              <description>NVMKEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1</name>
          <displayName>PMD1</displayName>
          <description>PMD1</description>
          <addressOffset>0x770</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf8fb</resetMask>
          <fields>
            <field>
              <name>AD1MD</name>
              <description>AD1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2</name>
          <displayName>PMD2</displayName>
          <description>PMD2</description>
          <addressOffset>0x772</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc30f</resetMask>
          <fields>
            <field>
              <name>OC1MD</name>
              <description>OC1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3</name>
          <displayName>PMD3</displayName>
          <description>PMD3</description>
          <addressOffset>0x774</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x780</resetMask>
          <fields>
            <field>
              <name>PWM2MD</name>
              <description>PWM2MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>